In [40]:
import datetime

In [41]:

dt = datetime.datetime(2023, 1, 29, 9, 30)

In [42]:
one_hour_later = dt + datetime.timedelta(hours=1)

In [43]:
one_hour_later

datetime.datetime(2023, 1, 29, 10, 30)

In [44]:
one_day_earlier = dt - datetime.timedelta(days=1)

In [45]:
one_day_earlier

datetime.datetime(2023, 1, 28, 9, 30)

In [46]:
dt_now = datetime.datetime.now()

In [47]:
formatted_dt = dt.strftime("%d-%m-%Y %H:%M:%S")

In [48]:
formatted_dt

'29-01-2023 09:30:00'

In [49]:
str(str(datetime.datetime.now()).split(" ")[0])

'2023-04-08'

In [50]:
import pandas as pd

In [51]:
df = pd.DataFrame({"id":[1,2,3,4,5,6,7,8,9,10],
              "name":["hiten","manav","hardeep","akshy","sumit","varun","shubham","loyum","virat","sagar"],
              "date_of_joining":[datetime.datetime.now().strftime("%d-%m-%Y")]*10})

In [52]:
df

   id     name date_of_joining
0   1    hiten      08-04-2023
1   2    manav      08-04-2023
2   3  hardeep      08-04-2023
3   4    akshy      08-04-2023
4   5    sumit      08-04-2023
5   6    varun      08-04-2023
6   7  shubham      08-04-2023
7   8    loyum      08-04-2023
8   9    virat      08-04-2023
9  10    sagar      08-04-2023

In [53]:
todays_date = str(str(datetime.datetime.now()).split(" ")[0])

In [54]:
df['today'] = todays_date

In [55]:
df['today'] = pd.to_datetime(df['today'],dayfirst=True).dt.strftime('%Y-%m-%d')

In [56]:
df

   id     name date_of_joining       today
0   1    hiten      08-04-2023  2023-04-08
1   2    manav      08-04-2023  2023-04-08
2   3  hardeep      08-04-2023  2023-04-08
3   4    akshy      08-04-2023  2023-04-08
4   5    sumit      08-04-2023  2023-04-08
5   6    varun      08-04-2023  2023-04-08
6   7  shubham      08-04-2023  2023-04-08
7   8    loyum      08-04-2023  2023-04-08
8   9    virat      08-04-2023  2023-04-08
9  10    sagar      08-04-2023  2023-04-08